week6/day1/VideoGame/app/controllers/players_controller.rb

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]
SELECT "players".* FROM "players"
SELECT  1 AS one FROM "players" INNER JOIN "registrations" ON "players"."id" = "registrations"."player_id" WHERE "registrations"."tournament_id" = ? AND "players"."id" = ? LIMIT 1  [["tournament_id", 1], ["id", 1]]
---
	def jsonplayers
    tournament = Tournament.find_by_id(params[:id])
		players = Player.all.select do |player|
      !tournament.players.include?(player)

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "players".* FROM "players" WHERE "players"."name" = ? LIMIT 1  [["name", "player_name"]]
---
  def add_to_tournament
    puts params
    tournament = Tournament.find_by_id(params[:tournament_id])
    player = Player.find_by_name(params[:player_name])