week6/day1/VideoGame/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def jsontournament
  	tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "pepe"], ["created_at", "2015-11-30 14:21:21.965487"], ["updated_at", "2015-11-30 14:21:21.965487"]]
---
  def create
  	tournament = Tournament.create(tournament_params)

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 6]]
---
  def destroy
  	tournament = Tournament.find_by(id: params[:id])

  	if tournament
  		tournament.destroy